app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY release_date
SELECT "movies".* FROM "movies"  ORDER BY release_date
---
    @sort_para=params[:sort_para]
    @ratings = params[:ratings]
    if @ratings and @sort_para
      @movies =Movie.where(:rating=>@ratings.keys).order(@sort_para)
    elsif @ratings
      @movies =Movie.where(:rating=>@ratings.keys)
    elsif @sort_para
      @movies = Movie.order(@sort_para)